src/Catalogs/Специализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Специализации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтоматологическиеУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециализацияПоКлассификаторуИЭМК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Специализации/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Инициализировать предопределенную специализацию по должности
//
// Параметры:
//  Должность				 - 	 - 
//  НаименованиеДолжности	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьПредопределеннуюСпециализациюПоДолжности(Должность = Неопределено, НаименованиеДолжности = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Должность) И НЕ ЗначениеЗаполнено(СокрЛП(НаименованиеДолжности)) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(НаименованиеДолжности)) Тогда 
		НаименованиеДолжности = СокрЛП(ОбщегоНазначения.ПолучитьЗначениеРеквизита(Должность, "Наименование"));
		Если НЕ ЗначениеЗаполнено(НаименованиеДолжности) Тогда 
			Возврат Неопределено;
		КонецЕсли;	
	КонецЕсли;	
	
	Специализация = Справочники.Специализации.ПустаяСсылка();
	Если Найти(НРег(НаименованиеДолжности), "ортодонт") > 0 Тогда 
		Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Ортодонтия");
	ИначеЕсли Найти(НРег(НаименованиеДолжности), "гигиен") > 0 Тогда 
		Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Гигиена");
	ИначеЕсли Найти(НРег(НаименованиеДолжности), "хирург") > 0 Тогда  
		Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Хирургия");  
	ИначеЕсли Найти(НРег(НаименованиеДолжности), "ортопед") > 0 Тогда  
		Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Ортопедия"); 
	ИначеЕсли Найти(НРег(НаименованиеДолжности), "терапев") > 0 Тогда	 
		Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Терапия"); 
	ИначеЕсли Найти(НРег(НаименованиеДолжности), "парадонт") > 0 Тогда 
		Специализация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Парадонтология"); 			
	КонецЕсли; 
	
	Возврат Специализация;
	
КонецФункции

// Процедура создает значения по умолчанию справочника "Специализации".
// 
Процедура СоздатьЗначенияПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивСпециализаций = Новый Массив();
	МассивСпециализаций.Добавить("Стоматология профилактическая");
	МассивСпециализаций.Добавить("Стоматология терапевтическая");
	МассивСпециализаций.Добавить("Стоматология хирургическая");
	МассивСпециализаций.Добавить("Стоматология ортопедическая");
	МассивСпециализаций.Добавить("Ортодонтия");
	МассивСпециализаций.Добавить("Стоматология");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Специализации.Ссылка КАК Ссылка,
	|	Специализации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Специализации КАК Специализации
	|ГДЕ
	|	НЕ Специализации.ПометкаУдаления
	|	И НЕ Специализации.ЭтоГруппа
	|	И Специализации.Наименование В (&МассивСпециализаций)");
	Запрос.УстановитьПараметр("МассивСпециализаций", МассивСпециализаций); 
	
	Выборка = Запрос.Выполнить().Выбрать();  
	Пока Выборка.Следующий() Цикл 
		
		Имя = ?(Выборка.Наименование = "Стоматология профилактическая", "Гигиена", ?(Выборка.Наименование = "Стоматология терапевтическая", "Терапия",
		?(Выборка.Наименование = "Стоматология хирургическая", "Хирургия", ?(Выборка.Наименование = "Стоматология ортопедическая", "Ортопедия",
		?(Выборка.Наименование = "Ортодонтия", "Ортодонтия", "Стоматология"))))); 
		Пердопределенный = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации."+ Имя);   
		Если Пердопределенный = Неопределено Тогда 
			ЭлементСправочника = Выборка.Ссылка.ПолучитьОбъект(); 
			ЭлементСправочника.Наименование = Имя;
			ЭлементСправочника.ИмяПредопределенныхДанных = Имя; 
			Попытка			
				ЭлементСправочника.Записать();
				ОбновитьПовторноИспользуемыеЗначения(); 
			Исключение       
				ЗаписьЖурналаРегистрации("Переименовать специализацию (" + Выборка.Наименование + ")", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ПредопределенныйСтоматология   = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Стоматология");
	ПредопределенныйГигиена        = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Гигиена");
	ПредопределенныйТерапия        = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Терапия");
	ПредопределенныйХирургия       = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Хирургия"); 
	ПредопределенныйОртопедия      = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Ортопедия"); 
	ПредопределенныйОртодонтия     = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Ортодонтия");
	ПредопределенныйПарадонтология = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Специализации.Парадонтология"); 
	
	ПредопределенныеЭлементы = Новый ТаблицаЗначений();
	ПредопределенныеЭлементы.Колонки.Добавить("ИмяПредопределенных");
	
	Если ПредопределенныйСтоматология = Неопределено Тогда
		Стр = ПредопределенныеЭлементы.Добавить();
		Стр.ИмяПредопределенных = "Стоматология";
	КонецЕсли;
	Если ПредопределенныйГигиена = Неопределено Тогда
		Стр = ПредопределенныеЭлементы.Добавить();
		Стр.ИмяПредопределенных = "Гигиена";
	КонецЕсли;	
	Если ПредопределенныйТерапия = Неопределено Тогда 
		Стр = ПредопределенныеЭлементы.Добавить();
		Стр.ИмяПредопределенных = "Терапия"; 
	КонецЕсли;	
	Если ПредопределенныйХирургия = Неопределено Тогда 
		Стр = ПредопределенныеЭлементы.Добавить();
		Стр.ИмяПредопределенных = "Хирургия"; 
	КонецЕсли;
	Если ПредопределенныйОртопедия = Неопределено Тогда 
		Стр = ПредопределенныеЭлементы.Добавить();
		Стр.ИмяПредопределенных = "Ортопедия";
	КонецЕсли;  
	Если ПредопределенныйОртодонтия = Неопределено Тогда 
		Стр = ПредопределенныеЭлементы.Добавить();
		Стр.ИмяПредопределенных = "Ортодонтия";
	КонецЕсли; 
	Если ПредопределенныйПарадонтология = Неопределено Тогда
		Стр = ПредопределенныеЭлементы.Добавить();
		Стр.ИмяПредопределенных = "Парадонтология";
	КонецЕсли;  
	
	НеобходимоОбновитьПовторноИспользуемыеЗначения = Ложь;
	Для Каждого Строка Из ПредопределенныеЭлементы Цикл  
		ЭлементСправочника = Справочники.Специализации.СоздатьЭлемент(); 
		Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
			Код = ?(Строка.ИмяПредопределенных = "Гигиена", "233", ?(Строка.ИмяПредопределенных = "Стоматология", "208",
			?(Строка.ИмяПредопределенных = "Терапия", "176", ?(Строка.ИмяПредопределенных = "Хирургия", "177",
			?(Строка.ИмяПредопределенных = "Ортопедия", "175", ?(Строка.ИмяПредопределенных = "Ортодонтия", "173", "0")))))); 
			СпециализацияПоКлассификатору = Справочники.КлассификаторСпециальностей.НайтиПоКоду(Формат(Число(Код), "ЧЦ=9; ЧВН=; ЧГ=0")); 
			ЭлементСправочника.СпециализацияПоКлассификаторуИЭМК = СпециализацияПоКлассификатору;
			ЭлементСправочника.КодПоОМС = СпециализацияПоКлассификатору.КодОИД; 		
		КонецЕсли;	
		ЭлементСправочника.Наименование              = Строка.ИмяПредопределенных;
		ЭлементСправочника.ИмяПредопределенныхДанных = Строка.ИмяПредопределенных; 
		Попытка
			ЭлементСправочника.Записать();
			НеобходимоОбновитьПовторноИспользуемыеЗначения = Истина;
		Исключение 
			ЗаписьЖурналаРегистрации("Создать предопределенный элемент специализации (" + Строка.ИмяПредопределенных + ")", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	Если НеобходимоОбновитьПовторноИспользуемыеЗначения Тогда 
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;				
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	

// Функция - Получить специализации.
// 
Функция ПолучитьСпециализации() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Специализации.Ссылка КАК Специализация
	|ИЗ
	|	Справочник.Специализации КАК Специализации
	|ГДЕ
	|	НЕ Специализации.ПометкаУдаления
	|	И НЕ Специализации.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Специализации.Представление";
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

#КонецОбласти
